content/chatd/diagram.mmd
C4Container
    System_Boundary(chatd_platform, "chatd application") {
        Container(chatd, "wazo-chatd", "Python", "Presentiel and Chat service")
        Container(db, "Postgresql", "C", "Database")
        Container(bus, "RabbitMQ", "Erlang", "Messaging Bus")
        Container(auth, "wazo-auth", "Python", "Authentication service")

        Container(amid, "wazo-amid", "Python", "")
        Container(confd, "wazo-confd", "Python", "")
    }

    Person(User, "User")

    Rel(chatd, amid, "Get phone status", "REST")
    Rel(chatd, confd, "Get user list", "REST")
    Rel(chatd, auth, "Get sessions", "REST")
    Rel(User, chatd, "Retrieves presences", "REST")
    Rel(chatd, db, " ", "SQL")
    Rel(chatd, bus, "Publishs and Recevied internal events", "AMQP")
    Rel(chatd, auth, "Authenticates", "REST")
